# CannotGenerateRamp Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..CannotGenerateRamp Property
BuiltInFailures..::..StairRampFailures Class See Also
---
Couldn't generate surfaces for ramp.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotGenerateRamp { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotGenerateRamp As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotGenerateRamp {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace